/*
 * D7.c
 * 
Составить рекурсивную функцию, печать всех чисел от N до 1. 
Данные на входе: 	Одно натуральное число 
Данные на выходе: 	Последовательность целых чисел от введенного числа до 1, через пробел. 

Пример
Данные на входе: 		5 
Данные на выходе: 	5 4 3 2 1 
 */


#include <stdio.h>

void count_num(int num)
{
		
		if (num == 0)
		return ;
		printf ("%d ", num );
		count_num(num - 1);
}

int main ()
{
	int num;
	scanf ("%d", &num);
	count_num(num);
	return 0;
}

